<a href="https://colab.research.google.com/github/cypher2108/practice-machine-learning/blob/main/Multiple_linear_regression_example.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
from sklearn import linear_model
df = pd.read_csv("hiring-nan.csv")
print(df)

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0         NaN                    8.0                           9      50000
1         NaN                    8.0                           6      45000
2         5.0                    6.0                           7      60000
3         2.0                   10.0                          10      65000
4         7.0                    9.0                           6      70000
5         3.0                    7.0                          10      62000
6        10.0                    NaN                           7      72000
7        11.0                    7.0                           8      80000

In [2]:
df.isnull().sum()

experience                    2
test_score(out of 10)         1
interview_score(out of 10)    0
salary($)                     0
dtype: int64

In [3]:
import numpy as np
missing_values=[' ','','??','na','X','999999']
df=df.replace(missing_values,np.NaN)
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0         NaN                    8.0                           9      50000
1         NaN                    8.0                           6      45000
2         5.0                    6.0                           7      60000
3         2.0                   10.0                          10      65000
4         7.0                    9.0                           6      70000
5         3.0                    7.0                          10      62000
6        10.0                    NaN                           7      72000
7        11.0                    7.0                           8      80000

In [4]:
df["test_score(out of 10)"]=df["test_score(out of 10)"].astype("float64")
n=round(df["test_score(out of 10)"].median(),2)
n

df["experience"]=df["experience"].astype("float64")
m=round(df["experience"].median(),2)
m

6.0

In [5]:
df["experience"].fillna(m,inplace=True)
df["test_score(out of 10)"].fillna(n,inplace=True)
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0         6.0                    8.0                           9      50000
1         6.0                    8.0                           6      45000
2         5.0                    6.0                           7      60000
3         2.0                   10.0                          10      65000
4         7.0                    9.0                           6      70000
5         3.0                    7.0                          10      62000
6        10.0                    8.0                           7      72000
7        11.0                    7.0                           8      80000

In [6]:
X = df[['experience', 'test_score(out of 10)', 'interview_score(out of 10)']]
y = df['salary($)']

In [7]:
regr = linear_model.LinearRegression()
regr.fit(X, y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [8]:
predicted_salary_1 = regr.predict([[2, 9, 6]])

print(predicted_salary_1)

[47056.91056911]

In [9]:
predicted_salary_2 = regr.predict([[12, 10, 10]])

print(predicted_salary_2)

[88227.64227642]